app/views/books/edit.slim

      = form.label :author_id
      = form.collection_select :author_id, Author.all, :id, :name, class: 'form-control'
---
SELECT "authors".* FROM "authors"