app/views/books/index.slim

SELECT DISTINCT "authors".* FROM "authors" INNER JOIN "books" ON "books"."author_id" = "authors"."id"
---
                        = f.label :author_id_eq, "Select Author", class: "control-label"
                        = f.collection_select :author_id_eq, Author.joins(:books).distinct, :id, :name