app/views/books/index.slim

        td = book.genre
        td = book.author.name if book.author.present?
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]