app/views/books/show.slim

  strong Author:
  = @book.author.name if @book.author.present?
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]