app/controllers/books_controller.rb

SELECT "books".* FROM "books" WHERE "books"."id" = ?  [["id", 2]]
---
  def set_book
    @book = Book.find(params[:id])