app/controllers/books_controller.rb

  def show_genre
        @genre = params[:genre]
        allowed_genres = %w[kids horror comedy romance mystery]
        if allowed_genres.include?(@genre)
          @books = Book.where(genre: @genre.capitalize)
---
SELECT "books".* FROM "books" WHERE "books"."genre" = ?  [["genre", "Kids"]]

  def update
    @book = Book.find(params[:id])
    @book.cover_image.attach(params[:book][:cover_image])
    if @book.update(book_params)
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "updated_at" = ? WHERE "books"."id" = ?  [["updated_at", "2024-08-20 08:45:21.132669"], ["id", 1]]