app/controllers/book_users_controller.rb

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT 1 AS one FROM "books" INNER JOIN "book_users" ON "books"."id" = "book_users"."book_id" WHERE "book_users"."user_id" = ? AND "books"."id" = ? LIMIT ?  [["user_id", 5], ["id", 4], ["LIMIT", 1]]
INSERT INTO "book_users" ("user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["user_id", 5], ["book_id", 4], ["created_at", "2024-08-21 12:56:08.924295"], ["updated_at", "2024-08-21 12:56:08.924295"]]
---
    def create
        @book = Book.find(params[:book_id])
        unless current_user.books.include?(@book)
          current_user.books << @book