app/controllers/users_controller.rb

    def update
      if @user.update(user_params)
---
UPDATE "users" SET "updated_at" = ?, "contact" = ?, "address" = ?, "name" = ? WHERE "users"."id" = ?  [["updated_at", "2024-08-29 08:10:11.173731"], ["contact", ""], ["address", ""], ["name", "maria"], ["id", 6]]