app/models/book.rb

SELECT 1 AS one FROM "likes" WHERE "likes"."book_id" = ? AND "likes"."book_id" = ? LIMIT ?  [["book_id", 3], ["book_id", 5], ["LIMIT", 1]]
---
    def already_liked?(book)
        self.likes.exists?(book_id: book.id)