app/models/user.rb

SELECT 1 AS one FROM "users" WHERE "users"."library_card_number" = ? LIMIT ?  [["library_card_number", 53138], ["LIMIT", 1]]
---
  def generate_library_card_number
    loop do
      self.library_card_number = generate_unique_number
      break unless User.exists?(library_card_number: library_card_number)